module.exports = [
  {
    title: '基本命令',
    collapsable: true,
    children: [
      './01-基本命令/00-获取代码',
      './01-基本命令/02-记住密码',
      './01-基本命令/03-查看提交记录',
      './01-基本命令/04-分支',
      './01-基本命令/05-标签',
      './01-基本命令/06-查看修改和撤销修改',
    ]
  },
  {
    title: '常见问题',
    collapsable: true,
    children: [
      './02-常见问题/01-本地分支关联远程分支',
      './02-常见问题/02-git乱码问题',
      './02-常见问题/03-工作进行一半需切换到另一分支',
      './02-常见问题/04-修改commit信息',
      './02-常见问题/git-submodule',
    ]
  },
  {
    title: 'Git实践',
    collapsable: true,
    children: [
      './03-Git实践/01-Git基本工作流程',
      './03-Git实践/02-Git最佳实践',
    ]
  },
]